test/dummy/app/controllers/translatables_controller.rb

  def index
    @translatables = Translatable.all
---
SELECT "translatables"."id" FROM "translatables"

  def set_tr
    require 'faker'

    @translatable = Translatable.find(params[:id])
---
SELECT  "translatables".* FROM "translatables" WHERE "translatables"."id" = ? LIMIT 1  [["id", 1]]